
       01 REGALUNO.
              03 ID-ALUNO1              PIC 9(03).
              03 NM-ALUNO1              PIC X(20).
              03 ID-MATERIA1            PIC 9(03).
              03 NM-MATERIA1            PIC X(20).
              03 NT-APROVACAO           PIC 9(02)V9(02).
              03 ID-REGISTRO            PIC 9(03).
              03 ST-APROVACAO           PIC X(09).
              03 MD-ALUNO               PIC 9(02)V9(02).
