
       01 APRALUNO.
              03 ID-ALUNO2                     PIC 9(03).
              03 NM-ALUNO2                     PIC X(20).
              03 ID-MATERIA2                   PIC 9(03).
              03 NM-MATERIA2                   PIC X(20).
              03 NT-APROVACAO1                 PIC 9(02)V9(02).
              03 ID-REGISTRO1                  PIC 9(03).
              03 ST-APROVACAO1                 PIC X(09).
              03 MD-ALUNO1                     PIC 9(02)V9(02).
